[
  {
    "id": "2025-09-28",
    "date": "2025-09-28",
    "title": "Covenants: Making and Keeping a covenant",
    "speaker": "\"Pastor Joshua Mthanyelo",
    "duration": "1 hour 45  minutes",
    "scripture": "Genesis 17",
    "content": "Know Who You Make a Covenant With\n\nBe mindful of whom you enter into covenant with, for not all are righteous. Some are wicked. Understand the terms before you commit, for every covenant carries responsibility.\n\nGod, however, is faithful and worthy to uphold His part. When Abram was called, God commanded him to walk blamelessly. God was the one to establish the covenant, and Abram was to obey. Abram—whose name meant exalted father—was wealthy in livestock, yet he remained childless.\n\nIf you never yearn for more, you will remain in your current condition. But when you hunger for more and begin to act, the enemy will pursue you all the more. Entering covenant with God changes not only who you are, but also your spiritual dwelling place. The higher the Lord elevates you, the less those around you may understand you. God transforms you—and calls you also to influence those around you. Either bring them upward with you, or align yourself with those walking in the same direction.\n\nEven Abraham’s wife was renamed: Sarai became Sarah, meaning princess, to signify her role in the covenant. The people you surround yourself with will feed your spirit with what they believe. The hopeless and the hopeful cannot dwell together long, for hopelessness may weaken hope. Without firm grounding in Christ, the hopeful can also be dragged into despair.\n\nAbram’s name was changed to Abraham, meaning father of nations. With that change, he could no longer present himself as he once did. God promised him nations, descendants beyond number, and kings from his line. God’s covenant held three great promises, while Abraham’s duty was singular—walk blamelessly. Often, what God asks of us seems daunting at first, yet His power ensures we prosper in it.\n\nThe enemy will seek to instill fear, tempting you with worldly pleasures to deter you from covenant with the Lord. But you cannot truly live in God’s presence and remain unchanged. When you draw near, you become aware of your sins, of how far you fall short—and that awareness is evidence that the Holy Spirit is at work within you.\n\nLet us not settle for empty religion, but pursue a living relationship with the Lord. Let every day—not just Sundays—reflect His presence in us. Let fasting not be merely for deliverance from trouble, but for deeper knowledge of God, to encounter His presence, and to give Him all glory.",
    "video": "None"
  }
]
