[
  {
  "id": "2025-10-05",
  "date": "2025-10-05",
  "title": "Idols: When Sin Becomes Your God",
  "speaker": "Dash",
  "duration": "1 hour 20 minutes",
  "scripture": "Exodus 20:3-5, Matthew 6:33, Isaiah 42:8",
  "content": "Idolatry is not just about golden statues or ancient rituals — it is about anything that takes God's place in our hearts. When we cannot control our sin, or when our minds constantly dwell on it, that very thing becomes our god. During the COVID-19 lockdown, many people discovered where their trust truly lay — whether in substances, people, or habits. Idols often reveal themselves in times of isolation and testing.\n\n1. Idols Will Control You\nWhen sin governs your emotions, choices, or thoughts, it becomes your master. The things we cannot live without often have the loudest influence over our lives. Idols promise satisfaction but deliver bondage. We must examine what occupies our minds most — for that is where our worship truly lies.\n\n2. Idols Will Derail You\nIdols do not only control — they also distract and destroy. When we make people our idols, such as a spouse, friend, or partner, we set them up to fail because no human can bear the weight of divinity. Only God can accept us fully in our brokenness. Ask yourself: Who do you run to first when life feels unbearable? The answer often reveals your idol.\n\n3. Seek God's Will, Not Your Own\nMany fast or pray with a list of demands rather than a heart of surrender. We ask God to bless our desires instead of asking for His direction. True faith begins with the prayer, 'Lord, what is Your will for me?' When we seek His kingdom first, everything else falls into alignment. Our priorities change from self-centered desires to God-centered obedience.\n\n4. Faith Over Fear\nFaith does not remove fear or hardship. Even Jesus felt anguish before His crucifixion, yet He chose obedience. Moses felt unqualified because of his speech, yet God chose him to speak before Pharaoh. Faith is not the absence of fear — it is the decision to move forward with God despite fear. It accepts reality but looks upward, trusting that God's best is yet to come.\n\nReflection:\nWhat idols have taken God's place in your life? Are there habits, relationships, or thoughts that control your peace and decisions? Take time to reflect and ask the Holy Spirit to reveal areas of misplaced devotion. Remember, idols lose power when surrendered to God’s will. As you seek Him more, your eyes will grow blind to idols and open to His presence.\n\nCall to Action:\nThis week, commit to identifying one idol and surrendering it to God. Replace that idol with intentional worship — through prayer, Scripture reading, or fasting. Ask God daily, 'What is Your will for me today?' Let your faith be active even when you are afraid. Trust that God has chosen you for something greater, not because you are worthy, but because He is faithful.",
  "video": "https://www.youtube.com/watch?v=example123",
  "audio": "None"
  },
  {
  "id": "2025-09-07",
  "date": "2025-09-07",
  "title": "Nehemiah 1",
  "speaker": "Pastor Joshua Mthanyelo",
  "duration": "45 min",
  "scripture": "Nehemiah 1:1-4",
  "content": "Guard the gates of your life. As Proverbs 4:23 reminds us: \"Above all else, guard your heart, for everything you do flows from it.\" In life, there are many gates that lead to different areas of our existence—be intentional about the ones you choose to walk through.\n\nWe may make plans, but the Lord directs our steps (Proverbs 20:24).\n\nWhen a place of worship is compromised, the family and community are also affected.\n\nWhen change is coming, you do not need a crowd around you. Remember, loose lips sink ships. Those who carry wisdom can build anywhere in the world. Grow together with your neighbor (Proverbs 27:17) to increase your understanding and wisdom.\n\nTransformation begins in the mind. Unless we shift our mindset, our actions will not change. Start by correcting your perspective, then take accountability for your surroundings and actions. Avoid settling with the wicked, or you risk learning their ways (Proverbs 22:24-25).\n\nChange your thinking. Go big, or go home. You were created for greatness.",
  "video": "None",
  "audio": "None"
  },
  {
  "id": "2025-08-31",
  "date": "2025-08-31",
  "title": "Rise with Understanding",
  "speaker": "Pastor Joshua Mthanyelo",
  "duration": "45 min",
  "scripture": "Micah 4:13",
  "content": "Rise with an understanding that this is the calling from God. Rise, but separate the good from the bad.\n\nWe cannot do it all alone. Go down in a posture of prayer. We can conquer when depending on God. Our circumstances may say otherwise, but \"who will stand against us if God is for us?\" You're a giant.\n\nConsider the woman in John 4. She did not represent herself as others did, but when you look at her background, you understand her story.\n\nThe more you read the Word, the more understanding is poured unto you. Let your troubles be unto Him, and He shall bless you according to His will.\n\nWhere there is unity, the Lord shall be among them. As the Lord said, wherever there is gathering under His name, He shall be among them.",
  "video": "None",
  "audio": "None"
  },
  {
  "id": "2025-08-10",
  "date": "2025-08-10",
  "title": "King Makers",
  "speaker": "Pastor Joshua Mthanyelo",
  "duration": "45 min",
  "scripture": "Proverbs 31",
  "content": "Women are so important. The Lord took His time to make them. He created all things beautiful but saw it needed something more—women.\n\nThe book of Proverbs is deeply rooted in cultural wisdom.\n\nWomen are created to create kings:\n1. Learn how to speak with a man to uplift him and speak life into him. The tongue has the power of life and death.\n\nMothers, teach your children to be confident so that they are not misled by the words of wicked men or women. Build their confidence and root them in the ways of the Lord.\n\nWomen, speak to your children. Young men grow up to become disobedient because of a lack of guidance at home. Igotshwa isemanzi. Place your young ones in the right lane at the right time.",
  "video": "None",
  "audio": "None"
  }
]
