[
  {
    "id": "2025-09-28",
    "date": "2025-09-28",
    "title": "Covenants: Making and Keeping a covenant",
    "speaker": "Pastor Joshua Mthanyelo",
    "duration": "45 minutes",
    "scripture": "Genesis 17",
    "content": "Know who you are making a covenant with because some arewicked. Know the terms of the covenant too, before making one.\nGod is worthy to keep His part of the covenant. Abram was told to come before God without crime. And  is to make the promise.\nAbraham means exalted father. He had a lot of livestock, yet he had no children of his own.\nIf you don't yearn for more, you won't change your current situation. And when you do yearn for more, and do do more, the enemy will hunt you even more. Once you make a covenant with God you not only change how you are, but you change your place of dwelling spiritually. The more the Lord raises you, the lesser the ones around you will understand you. God will change how you are, and you are to change those you are around with. Try to put them at your position or find ones who are at or in the direction you are going. Abraham's wife was also renamed to Sarah - meaning princess - to reflect her role in the covenant. Those you keep around will feed you with what they believe. The hopeless and hopeful cannot spend much time together, as the hopeless may feed they hopelessness to the hopeful. Without proper ground, without faith in Jesus, the hopeful will too be hopeless.\nAbram was renamed to Abraham, meaning "father of nations". With this change he can not present himself as he did when his name was Abram. The Lord promised to make him Abraham - father of nations, He will give him multitudes, and make him of king of nations. God's side of the covenant has three duties, yet Abraham's is one small task - to come without any crime. Sometimes the Lord will give us something to do, and at first it may seem big, but know the Lord will prosper you.n\The devil will make you fear making a covenant with the Lord. He may tempt you with the pleasures of the world and lead you astray. You cannot live in God's presence and not feel or see any change. When you come to Him, you feel more of sinner, someone who does wrong all the time. That is normal. It shows the Holy Spirit is working within you. \nLet us not dwell on religion, but on a personal relationship with the Lord. Let us live everyday of our lives representing God. May we not try to live as Jesus did only Sundays. May we not fast because we want to be relieved out of our current troubles; but to know God, to feel His presence and to give all glory to Him.",
    "file": "notes/2025-09-28.pdf",
    "video": "https://www.youtube.com/watch?v=abcd1234"
  }
]

